freeCube/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
	upperWall
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	lowerWall
	{
		type fixedValue;
		value uniform (-0.5 0 0);
	}
	leftWall
	{
		type fixedValue;
		value uniform (5 0 0);
	}
	rightWall
	{
		type zeroGradient;
	}
	frontWall
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	backWall
	{
		type fixedValue;
		value uniform (0 0 0);
	}
}
