freeCube/0/conc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      conc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 -3 0 0 1 0 0];

internalField uniform 0;

boundaryField
{
	upperWall
	{
		type zeroGradient;
	}
	lowerWall
	{
		type zeroGradient;
	}
	leftWall
	{
		type fixedValue;
		value uniform 1000;
	}
	rightWall
	{
		type zeroGradient;
	}
	frontWall
	{
		type zeroGradient;
	}
	backWall
	{
		type zeroGradient;
	}
}
