freeCube/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField uniform 1e+05;

boundaryField
{
	upperWall
	{
		type zeroGradient;
	}
	lowerWall
	{
		type zeroGradient;
	}
	leftWall
	{
		type zeroGradient;
	}
	rightWall
	{
		type fixedValue;
		value uniform 1e+05;
	}
	frontWall
	{
		type zeroGradient;
	}
	backWall
	{
		type zeroGradient;
	}	
}
