freeCube/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (5 0 0)
    (5 1 0)
    (0 1 0)
    (0 0 1)
    (5 0 1)
    (5 1 1)
    (0 1 1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch upperWall 
    (
        (3 7 6 2)
    )
    patch leftWall 
    (
        (0 4 7 3)
    )
    patch rightWall
    (
	(2 6 5 1)
    )
    patch frontWall
    (
        (4 5 6 7)
    )
    patch backWall
    (
	(1 0 3 2)
    )
    patch lowerWall
    (
	(0 1 5 4)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
