freeCube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upperWall
    {
        type            patch;
        nFaces          100;
        startFace       2700;
    }
    leftWall
    {
        type            patch;
        nFaces          100;
        startFace       2800;
    }
    rightWall
    {
        type            patch;
        nFaces          100;
        startFace       2900;
    }
    frontWall
    {
        type            patch;
        nFaces          100;
        startFace       3000;
    }
    backWall
    {
        type            patch;
        nFaces          100;
        startFace       3100;
    }
    lowerWall
    {
        type            patch;
        nFaces          100;
        startFace       3200;
    }
)

// ************************************************************************* //
